## PANDAS

In [166]:
import numpy as np
import pandas as pd

### Series

In [2]:
benimSozlugum = {"Atil" : 50, "Zeynpe" : 40, "Mehmet" : 30}

In [5]:
pd.Series(benimSozlugum)

Atil      50
Zeynpe    40
Mehmet    30
dtype: int64

In [6]:
type(pd.Series(benimSozlugum))

pandas.core.series.Series

In [10]:
benimYaslarim = [40,50,30]
benimIsimlerim= ["Atil", "Zeynep", "Mehmet"]

In [11]:
pd.Series(benimYaslarim, benimIsimlerim)

Atil      40
Zeynep    50
Mehmet    30
dtype: int64

In [12]:
pd.Series(data=benimYaslarim, index=benimIsimlerim)

Atil      40
Zeynep    50
Mehmet    30
dtype: int64

In [13]:
numpyDizisi = np.array([50,40,30])

In [14]:
numpyDizisi

array([50, 40, 30])

In [15]:
pd.Series(numpyDizisi)

0    50
1    40
2    30
dtype: int32

In [16]:
pd.Series(numpyDizisi,benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int32

In [17]:
pd.Series(["Atil","Atlas","Osman"],[1,2,3])

1     Atil
2    Atlas
3    Osman
dtype: object

In [18]:
yarismaSonucu1 = pd.Series([10,5,1],["Atil", "Atlas", "Osman"])

In [19]:
yarismaSonucu1

Atil     10
Atlas     5
Osman     1
dtype: int64

In [21]:
yarismaSonucu2 = pd.Series([20,10,8],["Atil", "Atlas", "Osman"])

In [22]:
yarismaSonucu2

Atil     20
Atlas    10
Osman     8
dtype: int64

In [23]:
yarismaSonucu2["Atlas"]

10

In [24]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2

In [25]:
sonSonuc

Atil     30
Atlas    15
Osman     9
dtype: int64

In [29]:
farkliSeries = pd.Series([20,30,40,50],["a","b","c","d"])

In [30]:
farkliSeries2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [31]:
farkliSeries

a    20
b    30
c    40
d    50
dtype: int64

In [32]:
farkliSeries2

a    10
c     5
f     3
g     1
dtype: int64

In [33]:
farkliSeries+farkliSeries2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

### DataFrame

In [36]:
data = np.random.randn(4,3)

In [37]:
data

array([[ 1.29777515,  0.77571813,  0.02226052],
       [-1.20715179, -0.01331922, -0.11564792],
       [-0.81472295, -0.42299706, -0.40307491],
       [ 1.07070522,  1.00097999, -0.49769527]])

In [38]:
dataFrame = pd.DataFrame(data)

In [39]:
dataFrame

          0         1         2
0  1.297775  0.775718  0.022261
1 -1.207152 -0.013319 -0.115648
2 -0.814723 -0.422997 -0.403075
3  1.070705  1.000980 -0.497695

In [40]:
dataFrame[0]

0    1.297775
1   -1.207152
2   -0.814723
3    1.070705
Name: 0, dtype: float64

In [41]:
type(dataFrame[0])

pandas.core.series.Series

In [42]:
yeniDataFrame = pd.DataFrame(data, index =["Atil", "Zeynep", "Atlas", "Mehmet"], columns = ["Maas", "Yas", "Calisma Saati"])

In [43]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.297775  0.775718       0.022261
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet  1.070705  1.000980      -0.497695

In [44]:
yeniDataFrame["Yas"]

Atil      0.775718
Zeynep   -0.013319
Atlas    -0.422997
Mehmet    1.000980
Name: Yas, dtype: float64

In [45]:
yeniDataFrame["Calisma Saati"]

Atil      0.022261
Zeynep   -0.115648
Atlas    -0.403075
Mehmet   -0.497695
Name: Calisma Saati, dtype: float64

In [46]:
yeniDataFrame[["Maas", "Yas"]]

            Maas       Yas
Atil    1.297775  0.775718
Zeynep -1.207152 -0.013319
Atlas  -0.814723 -0.422997
Mehmet  1.070705  1.000980

In [47]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.297775  0.775718       0.022261
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet  1.070705  1.000980      -0.497695

In [49]:
yeniDataFrame.loc["Atil"]

Maas             1.297775
Yas              0.775718
Calisma Saati    0.022261
Name: Atil, dtype: float64

In [50]:
yeniDataFrame.loc["Zeynep"]

Maas            -1.207152
Yas             -0.013319
Calisma Saati   -0.115648
Name: Zeynep, dtype: float64

In [52]:
yeniDataFrame.iloc[1]

Maas            -1.207152
Yas             -0.013319
Calisma Saati   -0.115648
Name: Zeynep, dtype: float64

In [53]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.297775  0.775718       0.022261
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet  1.070705  1.000980      -0.497695

In [54]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [56]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    1.297775  0.775718       0.022261        1.551436
Zeynep -1.207152 -0.013319      -0.115648       -0.026638
Atlas  -0.814723 -0.422997      -0.403075       -0.845994
Mehmet  1.070705  1.000980      -0.497695        2.001960

In [58]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1)

            Maas       Yas  Calisma Saati
Atil    1.297775  0.775718       0.022261
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet  1.070705  1.000980      -0.497695

In [59]:
yeniDataFrame.drop("Mehmet", axis = 0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    1.297775  0.775718       0.022261        1.551436
Zeynep -1.207152 -0.013319      -0.115648       -0.026638
Atlas  -0.814723 -0.422997      -0.403075       -0.845994

In [60]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    1.297775  0.775718       0.022261        1.551436
Zeynep -1.207152 -0.013319      -0.115648       -0.026638
Atlas  -0.814723 -0.422997      -0.403075       -0.845994
Mehmet  1.070705  1.000980      -0.497695        2.001960

In [61]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace=True)

In [62]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.297775  0.775718       0.022261
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet  1.070705  1.000980      -0.497695

In [63]:
yeniDataFrame.loc["Atil"]["Calisma Saati"]

0.02226052137406895

In [64]:
yeniDataFrame.loc["Atlas","Yas"]

-0.4229970575155179

In [65]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.297775  0.775718       0.022261
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet  1.070705  1.000980      -0.497695

In [67]:
booleanFrame = yeniDataFrame < 0

In [68]:
booleanFrame

         Maas    Yas  Calisma Saati
Atil    False  False          False
Zeynep   True   True           True
Atlas    True   True           True
Mehmet  False  False           True

In [69]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.297775  0.775718       0.022261
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet  1.070705  1.000980      -0.497695

In [71]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil         NaN       NaN            NaN
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet       NaN       NaN      -0.497695

In [73]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Atil         NaN       NaN            NaN
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet       NaN       NaN      -0.497695

In [76]:
 yeniDataFrame["Calisma Saati"] > 0

Atil       True
Zeynep    False
Atlas     False
Mehmet    False
Name: Calisma Saati, dtype: bool

In [77]:
yeniDataFrame[ yeniDataFrame["Calisma Saati"] > 0]

          Maas       Yas  Calisma Saati
Atil  1.297775  0.775718       0.022261

In [78]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.297775  0.775718       0.022261
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet  1.070705  1.000980      -0.497695

In [79]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil  1.297775  0.775718       0.022261
1  Zeynep -1.207152 -0.013319      -0.115648
2   Atlas -0.814723 -0.422997      -0.403075
3  Mehmet  1.070705  1.000980      -0.497695

In [80]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.297775  0.775718       0.022261
Zeynep -1.207152 -0.013319      -0.115648
Atlas  -0.814723 -0.422997      -0.403075
Mehmet  1.070705  1.000980      -0.497695

In [84]:
yeniIndexListesi = ["Ati","Zey","Atl","Meh"]

In [86]:
yeniDataFrame["Yeni Indeks"] = yeniIndexListesi

In [87]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil    1.297775  0.775718       0.022261         Ati
Zeynep -1.207152 -0.013319      -0.115648         Zey
Atlas  -0.814723 -0.422997      -0.403075         Atl
Mehmet  1.070705  1.000980      -0.497695         Meh

In [88]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          1.297775  0.775718       0.022261
Zey         -1.207152 -0.013319      -0.115648
Atl         -0.814723 -0.422997      -0.403075
Meh          1.070705  1.000980      -0.497695

In [90]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil    1.297775  0.775718       0.022261         Ati
Zeynep -1.207152 -0.013319      -0.115648         Zey
Atlas  -0.814723 -0.422997      -0.403075         Atl
Mehmet  1.070705  1.000980      -0.497695         Meh

In [91]:
yeniDataFrame.set_index("Yeni Indeks", inplace=True)

In [92]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          1.297775  0.775718       0.022261
Zey         -1.207152 -0.013319      -0.115648
Atl         -0.814723 -0.422997      -0.403075
Meh          1.070705  1.000980      -0.497695

In [93]:
yeniDataFrame.loc["Ati"]

Maas             1.297775
Yas              0.775718
Calisma Saati    0.022261
Name: Ati, dtype: float64

### Multi Index

In [94]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [95]:
icIndexler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [99]:
birlesmisIndex = list(zip(ilkIndexler, icIndexler))

In [100]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [108]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [109]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [110]:
benimCizgiFilmListem= [[40,"A"], [10,"B"],[30, "C"], [9, "D"],[10,"E"],[11,"F"]]

In [111]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [113]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi, index=birlesmisIndex, columns=["Yas","Meslek"])

In [114]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [115]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [116]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [117]:
cizgiFilmDataFrame.index.names=["Film Ad","sim"]

In [118]:
cizgiFilmDataFrame

                   Yas Meslek
Film Ad   sim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

### Operasyonlar

In [120]:
sozlukVerisi = {"stanbul" : [30,29,np.nan], "Ankara" : [20, np.nan, 25], "Izmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [121]:
havaDurumuDataFrame

   stanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [123]:
havaDurumuDataFrame.dropna()

   stanbul  Ankara  Izmir
0      30.0    20.0     40

In [124]:
havaDurumuDataFrame

   stanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [127]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

In [130]:
yeniVeri = {"stanbul" : [30,29,np.nan], "Ankara" : [20, np.nan, 25], "Izmir": [40,39,38], "Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [131]:
yeniDataFrame

   stanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [132]:
yeniDataFrame.dropna(axis=1, thresh=2)

   stanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [133]:
yeniDataFrame

   stanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [135]:
yeniDataFrame.fillna(20)

   stanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

### Groupby

In [148]:
maasSozlugu = {"Depertmanlar" : ["Yazlm","Sat","Pazarlama","Finanas","nsan Kaynaklar","Hukuk"],
               "Calisan Ismi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas" : [100,150,200,300,400,500]
               }

In [149]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [150]:
maasDataFrame

       Depertmanlar Calisan Ismi  Maas
0           Yazlm        Ahmet   100
1             Sat       Mehmet   150
2         Pazarlama         Atil   200
3           Finanas        Burak   300
4  nsan Kaynaklar       Zeynep   400
5             Hukuk        Fatma   500

In [152]:
maasSozlugu = {"Depertmanlar" : ["Yazlm","Yazlm","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calisan Ismi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas" : [100,150,200,300,400,500]
              }

In [153]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [155]:
maasDataFrame

  Depertmanlar Calisan Ismi  Maas
0      Yazlm        Ahmet   100
1      Yazlm       Mehmet   150
2    Pazarlama         Atil   200
3    Pazarlama        Burak   300
4        Hukuk       Zeynep   400
5        Hukuk        Fatma   500

In [158]:
grupObjesi = maasDataFrame.groupby("Depertmanlar")

In [159]:
grupObjesi.count()

              Calisan Ismi  Maas
Depertmanlar
Hukuk                    2     2
Pazarlama                2     2
Yazlm                  2     2

In [160]:
grupObjesi.mean()

              Maas
Depertmanlar
Hukuk          450
Pazarlama      250
Yazlm        125

In [161]:
grupObjesi.min()

             Calisan Ismi  Maas
Depertmanlar
Hukuk               Fatma   400
Pazarlama            Atil   200
Yazlm             Ahmet   100

In [163]:
grupObjesi.max()

             Calisan Ismi  Maas
Depertmanlar
Hukuk              Zeynep   500
Pazarlama           Burak   300
Yazlm            Mehmet   150

In [164]:
grupObjesi.describe()

              Maas
             count   mean        std    min    25%    50%    75%    max
Depertmanlar
Hukuk          2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama      2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazlm        2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [165]:
grupObjesi.describe().T

Depertmanlar       Hukuk   Pazarlama     Yazlm
Maas count      2.000000    2.000000    2.000000
     mean     450.000000  250.000000  125.000000
     std       70.710678   70.710678   35.355339
     min      400.000000  200.000000  100.000000
     25%      425.000000  225.000000  112.500000
     50%      450.000000  250.000000  125.000000
     75%      475.000000  275.000000  137.500000
     max      500.000000  300.000000  150.000000

In [168]:
sozluk1 = {"Ism" : ["Ahmet", "Mehmet", "Zeynep", "Damla"],
           "Spor" : ["Kou","Yzme","Kou","Basketbol"],
           "Kalori" : [100,200,300,400]
           }

In [169]:
dataFrame1 = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [170]:
dataFrame1

     Ism       Spor  Kalori
0   Ahmet       Kou     100
1  Mehmet      Yzme     200
2  Zeynep       Kou     300
3   Damla  Basketbol     400

In [172]:
sozluk2 = {"Ism" : ["Osman", "Levent", "Atlas", "Fatma"],
           "Spor" : ["Kou","Yzme","Kou","Basketbol"],
           "Kalori" : [200,100,50,300]
           }

In [174]:
dataFrame2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [175]:
sozluk3 = {"Ism" : ["Aye", "Mahmut", "Duygu", "Nur"],
           "Spor" : ["Kou","Yzme","Badminton","Tenis"],
           "Kalori" : [300,400,500,250]
           }

In [176]:
dataFrame3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [177]:
dataFrame2

     Ism       Spor  Kalori
4   Osman       Kou     200
5  Levent      Yzme     100
6   Atlas       Kou      50
7   Fatma  Basketbol     300

In [178]:
dataFrame3

      Ism       Spor  Kalori
8     Aye       Kou     300
9   Mahmut      Yzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

### concatenation

In [180]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], axis = 0)

      Ism       Spor  Kalori
0    Ahmet       Kou     100
1   Mehmet      Yzme     200
2   Zeynep       Kou     300
3    Damla  Basketbol     400
4    Osman       Kou     200
5   Levent      Yzme     100
6    Atlas       Kou      50
7    Fatma  Basketbol     300
8     Aye       Kou     300
9   Mahmut      Yzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

### merge

In [188]:
mergeSozluk1 = {"Ism" : ["Ahmet","Mehmet","Zeynep","Atl"],
                 "Spor" : ["Kou","Yzme","Kou","Basketbol"]
                }

In [189]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [190]:
mergeDataFrame1

     Ism       Spor
0   Ahmet       Kou
1  Mehmet      Yzme
2  Zeynep       Kou
3    Atl  Basketbol

In [191]:
mergeSozluk2 = {"Ism" : ["Ahmet","Mehmet","Zeynep","Atl"],
                 "Kalori" : [100,200,150,250]
                }

In [192]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [193]:
mergeDataFrame2

     Ism  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atl     250

In [194]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on="Ism")

     Ism       Spor  Kalori
0   Ahmet       Kou     100
1  Mehmet      Yzme     200
2  Zeynep       Kou     150
3    Atl  Basketbol     250

In [212]:
maasSozluk = { " Ismler" : ["Atl","Zeynep","Mehmet","Damla"],
               "Departman" : ["Yazlm","Sat","Pazarlama","Yazlm"],
                "Maas" : [200,300,400,500]}

In [213]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [214]:
maasDataFrame

   Ismler  Departman  Maas
0     Atl    Yazlm   200
1   Zeynep      Sat   300
2   Mehmet  Pazarlama   400
3    Damla    Yazlm   500

In [215]:
maasDataFrame["Departman"].unique()

array(['Yazlm', 'Sat', 'Pazarlama'], dtype=object)

In [216]:
maasDataFrame["Departman"].nunique()

3

In [217]:
maasDataFrame["Departman"].value_counts()

Yazlm      2
Sat        1
Pazarlama    1
Name: Departman, dtype: int64

In [218]:
def bruttenNete(maas):
    return maas * 0.66

In [220]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [221]:
maasDataFrame.isnull()

    Ismler  Departman   Maas
0     False      False  False
1     False      False  False
2     False      False  False
3     False      False  False

In [234]:
yeniBirVeri = {"Karakter Snf" : ["South Park","South Park","Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart"],
              "Karakter Yas" : [9,10,50,20]}

In [235]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [236]:
karakterDF

  Karakter Snf Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [238]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Snf","Karakter Ismi"])

                               Karakter Yas
Karakter Snf Karakter Ismi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

Fazladan isimler ayn olduu zaman isimlerin yaslarnn ortalamasn alr.

In [244]:
yeniBirVeri1 = {"Karakter Snf" : ["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
              "Karakter Yas" : [9,10,50,20,10]}

In [245]:
karakterDF1 = pd.DataFrame(yeniBirVeri1)

In [246]:
karakterDF1

  Karakter Snf Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [247]:
karakterDF1.pivot_table(values = "Karakter Yas", index = ["Karakter Snf","Karakter Ismi"])

                               Karakter Yas
Karakter Snf Karakter Ismi
Simpson         Bart                     15
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

-Bunu nlemek iin:
belirterek toplamasn alyoruz.

In [248]:
karakterDF1.pivot_table(values = "Karakter Yas", index = ["Karakter Snf","Karakter Ismi"], aggfunc=np.sum)

                               Karakter Yas
Karakter Snf Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

Exceli okurken:

yerini yazyoruz (Ayn klasrde olmas nemli)

dataFrame = pd.read_excel("maas.xlsx")
dataFrame

Excele yazarken:

doluDegerlerDataFrame.to_excel("yenimaas.xlsx)


not: csv formatnda ise:
read_csv
to_csv